{
  "name": "Tony Chen",
  "title": "Front-End Developer",
  "mobile": "0415931644",
  "email": "chenming8302@gmail.com",
  "profile": "I love programming. I can use various tools and technologies based on the needs of a project. I have 16 years of coding experience and understand the development process, so I am able to work with teams or work on projects independently. I can use my experience to analyze, resolve code issues, predict and avoid project risks. I have always followed the development of the industry and technology.",
  "experiences": [
    {
      "start": "2018-02-01",
      "end": "2022-10-01",
      "company": "Hyphenio, Brisbane, Australia",
      "duties": [
        "Created and maintained two mobile applications that can scan QR codes, push and receive notifications.",
        "Extended and maintained web applications which help customers manage graduation ceremonies for more than 23 universities. Created online-store web application for customer's staff and consumers. Created an application to generate reports and analyze sales data.",
        "Made an application to allow customers to make work plans online and send SMS, emails to team members.",
        "Created back-end applications and BigCommerce, Shopify and WooCommerce plugins for an insurance company to provide their services on those platforms.",
        "Created mobile applications for customers who worked in the mine area could update workbooks and read them offline and upload their daily work when they had internet access."
      ],
      "achievements": [
        "The applications developed for the university customer, have expanded their online business and improved their traditional business.",
        "The application developed for the mine customer, improved their workflow by freeing them from pen and paper and reading workbooks offline."
      ],
      "skills": [
        "HTML, CSS, Javascript",
        "ReactJS, React-Native, Expo, VueJS, AngularJS, NuxtJS",
        "PHP, Node, Laravel, GraphQL",
        "MySQL, MongoDB",
        "Git",
        "Wordpress"
      ]
    },
    {
      "start": "2016-10-01",
      "end": "2017-12-01",
      "company": "BrightFox, Brisbane, Australia",
      "duties": [
        "Made websites, mobile and kiosk applications for real-estate companies.",
        "Made a CRM system to allow salesmen to control the contents of websites and applications."
      ],
      "achievements": [
        "Added new features to the system which worked properly and received thanks from customers."
      ],
      "skills": [
        "HTML",
        "CSS & SCSS",
        "Javascript",
        "Git",
        "JQuery",
        "Ember",
        "AngularJS"
      ]
    },
    {
      "start": "2014-04-01",
      "end": "2015-12-01",
      "company": "TCL Corporation, Guangdong, China",
      "duties": [
        "Led a team to develop Android applications.",
        "Ensured projects were on schedule and managed the development process.",
        "Implemented unit tests and end-to-end tests."
      ],
      "achievements": [
        "Projects were delivered on schedule.",
        "Projects passed testing of the US team and AT&T."
      ],
      "skills": ["Java", "C++", "Git"]
    },
    {
      "start": "2005-09-01",
      "end": "2014-04-01",
      "company": "10Moons Technology Ltd, Guangdong, China",
      "duties": [
        "Made applications for TV boxes and PCI TV cards.",
        "Made applications and UI for IP cameras.",
        "Maintained applications and extended new features."
      ],
      "achievements": [
        "Always get work done on time.",
        "Made a testing application which reduced factory testing time and speeding up production."
      ],
      "skills": ["HTML & CSS", "C", "MFC", "SVN & GIT"]
    }
  ],
  "education": {
    "date": "09/2001-07/2005",
    "location": "Wuhan, China",
    "degree": "Bachelor of Computer Science and Technology",
    "university": "Wuhan University of Technology"
  }
}
